{
    "halo": "Halo juga! Apa kabar?",
    "nama": "Saya Hanasweep, senang bertemu dengan Anda!",
    "apa kabar": "Saya baik, bagaimana dengan Anda?",
    "siapa kamu": "Saya adalah chatbot sederhana buatan Hanasweep!",

    "siapa namamu": "Saya Hanasweep, asisten virtual Anda!",
    "darimana asalmu": "Saya berasal dari dunia digital, dibuat untuk membantu Anda!",
    "apa tujuanmu": "Tujuan saya adalah membantu dan menghibur Anda!",
    "bisakah kamu berpikir": "Saya tidak bisa berpikir seperti manusia, tetapi saya bisa merespons berdasarkan data yang saya miliki.",
    
    "apa itu ilmu pengetahuan": "Ilmu pengetahuan adalah proses sistematis untuk memahami alam semesta melalui observasi dan eksperimen.",
    "apa itu fisika": "Fisika adalah cabang ilmu pengetahuan yang mempelajari sifat dan perilaku materi serta energi di alam semesta.",
    "apa itu matematika": "Matematika adalah ilmu yang mempelajari angka, pola, dan struktur untuk memecahkan berbagai permasalahan.",
    "apa itu biologi": "Biologi adalah ilmu yang mempelajari makhluk hidup dan interaksinya dengan lingkungan.",
    "apa itu kimia": "Kimia adalah ilmu yang mempelajari zat, sifatnya, serta bagaimana mereka berinteraksi dan berubah.",
    "apa itu astronomi": "Astronomi adalah ilmu yang mempelajari benda-benda langit seperti bintang, planet, dan galaksi.",
    "apa itu teknologi": "Teknologi adalah penerapan ilmu pengetahuan untuk menciptakan alat dan sistem guna mempermudah kehidupan manusia.",
    
    "ceritakan lelucon": "Tentu! Kenapa komputer selalu diundang ke pesta? Karena dia punya banyak cache!",
    "kasih aku lelucon lagi": "Baik! Kenapa matematika selalu stres? Karena punya terlalu banyak masalah!",
    "lelucon sains": "Kenapa elektron selalu bersikap negatif? Karena itu sifat alaminya!",
    "lelucon teknologi": "Kenapa programmer tidak suka bercanda? Karena mereka takut error!",
    "lelucon fisika": "Apa yang dikatakan satu proton ke proton lainnya? 'Tetap positif!'",
    
    "berikan fakta menarik": "Tahukah Anda? Air panas membeku lebih cepat daripada air dingin dalam kondisi tertentu, fenomena ini disebut Efek Mpemba.",
    "fakta unik lainnya": "Fakta menarik! Jika kita bisa melubangi Bumi dan melompat ke dalamnya, kita akan sampai ke sisi lain dalam waktu sekitar 42 menit!",
    "fakta tentang luar angkasa": "Di luar angkasa, tidak ada suara karena tidak ada medium untuk merambatkan gelombang suara.",
    "fakta tentang bumi": "Bumi sebenarnya tidak bulat sempurna, tetapi sedikit pepat di kutub-kutubnya.",
    "fakta tentang hewan": "Gajah adalah satu-satunya hewan yang tidak bisa melompat!",
    "fakta tentang otak": "Otak manusia menghasilkan listrik yang cukup untuk menyalakan bola lampu kecil!",
    "fakta tentang teknologi": "Mouse komputer pertama kali dibuat dari kayu!",
    
    "apa yang bisa kamu lakukan": "Saya bisa menjawab pertanyaan, menceritakan lelucon, memberikan fakta menarik, dan banyak lagi!",
    "bisakah kamu bernyanyi": "Saya bisa mencoba, tapi suara saya mungkin tidak semerdu yang Anda harapkan!",
    "bisakah kamu menggambar": "Saya bisa membantu membuat gambar dengan AI, mau saya buatkan sesuatu?",
    "bisakah kamu bermain game": "Saya bisa merekomendasikan game, memberikan teka-teki, atau sekadar bercanda dengan Anda!"
}